/* eslint-disable prettier/prettier */
export default {
  blocklet: {
    restoreBlocklet: {
      title: 'ब्लॉकलेट को पुनर्स्थापित करें',
      description: 'कृपया उस ब्लॉक्लेट का चयन करें जिसे आप पुनर्स्थापित करना चाहते हैं',
      verify: {
        title: 'स्वामित्व को सत्यापित करें',
        subTitle: 'अपने डिजिटल पहचान पत्र वॉलेट के साथ ब्लॉकलेट के स्वामित्व की पुष्टि करें',
        verify: 'सत्यापित करें',
        reconnect: 'एक और ब्लॉकलेट की कोशिश करें',
        scan: 'स्वामित्व सिद्ध करने के लिए निम्नलिखित विधियों का प्रयोग करें',
        confirm: 'बैकअप को डाउनलोड और डिक्रिप्ट करने के लिए सर्वर को साइन डिलीगेशन दें',
        success: 'स्वामित्व सत्यापित, पुनर्स्थापना प्रगति में है',
        exists: 'यह ब्लॉकलेट पहले से ही इस सर्वर पर मौजूद है और पुनर्स्थापना रद्द कर दी गई है',
        open: 'ब्लॉकलेट का दौरा करें',
        overwrite: 'अधिलिखित करें',
      },
      overwrite: {
        title: 'मौजूदा ब्लॉकलेट को अधिलेखित करें?',
        description:
          'यह ब्लॉकलेट जिसे आप पुनर्स्थापित कर रहे हैं, पहले से इस सर्वर पर मौजूद है, क्या आप इसे अधिलिखित करना चाहते हैं?',
      },
      restore: {
        title: 'ब्लॉकलेट की स्थानापना करें',
      },
    },
    restoreFromServer: {
      selectTitle: 'एप्लिकेशन चुनें',
      description: 'कृपया वह एप्लिकेशन चुनें जिसे आप पुनर्स्थापित करना चाहते हैं',
      backupIn: 'बैकअप में',
    },
    restoreFromSpaces: {
      title: 'DID स्थानों से पुनर्स्थापित करें',
      navSubTitle: 'पुनर्स्थापित करें',
      connect: {
        title: 'DID Spaces से कनेक्ट करें',
        subTitle: 'DID Spaces पर जाएं और उस ब्लॉकलेट को चुनें जिसे आप पुनर्स्थापित करना चाहते हैं।',
        select: 'DID Spaces गेटवे का चयन करें',
        connect: 'कनेक्ट करें',
      },
      selectBlocklet: {
        title: 'ऐप का चुनाव करें',
      },
      restore: {
        title: 'ऐप को बहाल करें',
        subTitle: 'ऐप्लिकेशन को पुनर्स्थापित किया जा रहा है',
        completeTitle: 'सब तैयार है',
        installedTitle: 'सफलतापूर्वक पुनर्स्थापित किया गया!',
        installedSubTitle: 'लेकिन शुरू करने के लिए कुछ कॉन्फ़िगरेशन की आवश्यकता होती है',
        support:
          'यदि पुनः प्रयास करने से काम नहीं बनता है, कृपया <a href="{communityLink}" target="_blank">समुदाय</a> में मदद मांगें या हमसे संपर्क करें <a href="mailto: {supportEmail}">{supportEmail}</a> पर।',
      },
      nftAuthDialog: {
        title: 'कृपया अपना App Space NFT प्रस्तुत करें',
        scan: 'अपने डीआईडब्ल्यू वॉलेट के साथ क्यूआर कोड स्कैन करें और अपना एनएफटी प्रस्तुत करें',
        confirm: 'अपने खाते में पुष्टि करें',
        success: 'NFT सफलतापूर्वक सत्यापित किया गया!',
      },
      progress: {
        waiting: 'पुनर्स्थापन की प्रतीक्षा कर रहें...',
        restoring: 'पुनर्स्थापन...',
        importData: 'डाटा आयात कर रहा है...',
        downloading: 'फ़ाइलें डाउनलोड हो रही हैं, प्रगति: {progress}',
        importSuccess: 'सफलतापूर्वक आयात किया गया!',
        installing: 'स्थापित कर रहा हूँ...',
      },
    },
  },
  server: {
    checkUpgrade: 'नई संस्करण देखें',
  },
};
